need_exploer = {'沉香': 3, '紫苏木': 1, '浙贝母': 11, '厚朴': 4, '白果': 1, '桂心': 2, '麻黄': 5, '牡丹皮': 2,
                '寒水石': 1, '紫苏子': 5, '玄参': 2, '五味子': 8, '黄芩': 6, '山药': 2, '松子仁': 1, '薏米': 1,
                '百部': 4, '莱菔子': 2, '诃子': 1, '熟地黄': 3, '干姜': 6, '炙甘草': 5, '粳米': 1, '白芍': 5, '大枣': 4,
                '党参': 1, '甘草': 24, '生姜': 4, '瓜蒌仁': 4, '竹叶': 2, '前胡': 7, '大腹皮': 1, '紫菀': 5, '陈皮': 13,
                '白前': 2, '白术': 3, '麦冬': 14, '紫苏梗': 1, '滑石': 1, '半夏': 16, '黄芪': 4, '菊花': 1, '防风': 1,
                '紫苏叶': 3, '薄荷': 2, '当归': 6, '砂仁': 1, '青皮': 1, '蜂蜜': 1, '款冬花': 5, '山萸': 2, '芦根': 1,
                '栀子': 5, '金沸草': 1, '大黄': 1, '泽泻': 1, '阿胶': 4, '枳壳': 5, '连翘': 1, '桑叶': 2, '石膏': 2,
                '细辛': 5, '枸杞': 1, '小麦': 1, '桔梗': 20, '地骨皮': 3, '白芥子': 1, '白药': 1, '石膏': 5,
                '陈皮': 2, '知母': 5, '陈皮': 2, '生地黄': 5, '沙参': 3, '茯苓': 17, '胡麻仁': 1, '荆芥': 2, '天冬': 2,
                '复花': 1, '杏仁': 13, '桑皮': 11, '枳实': 1, '人参': 10, '枇杷叶': 3, '乌梅': 2, '川贝': 2, '肉桂': 1,
                '百合': 2, '香附': 2, '瓜蒌皮': 1}
prescriptions = {
    # "已有饮片": ['百部', '半夏', '防风', '甘草', '僵蚕', '焦山楂', '连翘', '杏仁', '郁金', '浙贝母'],

    # -----------------------咳嗽---------------------------
    # 常用
    "止嗽散": ['紫菀', '百部', '白前', '桔梗', '荆芥', '陈皮', '炙甘草'],
    "定喘汤": ['白果', '麻黄', '紫苏子', '甘草', '款冬花', '杏仁', '桑皮', '黄芩', '半夏'],
    "清燥救肺汤": ['桑叶', '石膏', '阿胶', '麦冬', '杏仁', '枇杷叶', '沙参', '胡麻仁', '甘草'],
    "二陈汤": ['半夏', '化橘红', '茯苓', '炙甘草'],
    "百合固金汤": ['生地黄', '熟地黄', '麦冬', '百合', '白芍', '当归', '浙贝母', '甘草', '玄参', '桔梗'],
    "养阴清肺汤": ['生地黄', '麦冬', '甘草', '玄参', '浙贝母', '牡丹皮', '薄荷', '白芍'],
    # "桑杏汤": ['桑叶', '杏仁', '沙参', '浙贝母', '豆豉', '栀子', '梨皮'],

    "百部丸": ['百部', '麻黄', '杏仁', '松子仁'],
    "百部汤": ['百部', '薏米', '百合', '麦冬', '桑皮', '茯苓', '沙参', '黄芪', '地骨皮'],
    "止咳宁嗽": ['桔梗', '荆芥', '百部', '紫菀', '白前', '前胡', '款冬花', '麻黄', '陈皮', '杏仁', '防风'],
    # "痰核消散汤": ['柴胡', '郁金', '党参', '白术', '茯苓', '陈皮', '白芥子', '海藻', '僵蚕', '浙贝母', '夏枯草', '半夏',
    #                '土鳖虫', '桂枝', '甘草'],
    "麦冬汤": ['麦冬', '半夏', '人参', '甘草', '粳米', '大枣'],
    "厚朴麻黄汤": ['厚朴', '麻黄', '石膏', '杏仁', '半夏', '干姜', '细辛', '小麦', '五味子'],

    # 86岁老中医毕生总结的治咳七法：https://www.sohu.com/a/508784028_120099896
    "杏苏散": ['杏仁', '紫苏叶', '桔梗', '枳壳', '前胡', '半夏', '陈皮', '茯苓', '炙甘草', '大枣'],
    "三拗汤": ['麻黄', '杏仁', '甘草', '生姜'],
    "桑菊饮": ['桑叶', '菊花', '薄荷', '杏仁', '桔梗', '甘草', '连翘', '芦根'],
    # "加减银翘散": ['金银花', '连翘', '桔梗', '薄荷', '芥穗', '牛蒡子', '浙贝母', '杏仁', '豆豉', '甘草'],
    "加减流气饮子": ['厚朴', '紫苏叶', '陈皮', '大腹皮', '瓜蒌皮', '桔梗', '枳壳', '半夏', '茯苓', '香附', '炙甘草'],
    "加减七气汤": ['厚朴', '半夏', '茯苓', '白芍', '紫苏叶', '陈皮', '杏仁', '桔梗', '前胡', '桑皮', '浙贝母'],
    "苏子降气汤": ['紫苏子', '厚朴', '半夏', '前胡', '沉香', '当归', '甘草', '生姜'],
    "加味沉香降气汤": ['香附', '陈皮', '紫苏子', '桑皮', '砂仁', '沉香', '桔梗', '莱菔子', '甘草'],
    "三子养亲汤": ['紫苏子', '白芥子', '莱菔子'],
    "半瓜丸": ['半夏', '瓜蒌仁', '桔梗', '枳壳', '知母'],
    # "桃仁散": ['桃仁', '桑皮', '茯苓', '橘络', '紫苏梗', '紫苏叶', '槟榔'],
    "加味当归饮": ['大黄', '当归', '紫苏木', '生地黄', '白芍', '桔梗', '浙贝母'],
    "清咽宁肺汤": ['桔梗', '栀子', '黄芩', '桑皮', '前胡', '知母', '浙贝母', '甘草'],
    "清肺汤": ['黄芩', '桔梗', '茯苓', '桑皮', '陈皮', '浙贝母', '天冬', '栀子', '杏仁', '麦冬', '甘草', '当归'],
    "清金化痰汤": ['黄芩', '栀子', '桔梗', '麦冬', '桑皮', '浙贝母', '知母', '瓜蒌仁', '化橘红', '茯苓', '甘草'],
    "二母宁嗽汤": ['石膏', '知母', '浙贝母', '栀子', '黄芩', '瓜蒌仁', '茯苓', '陈皮', '枳实', '甘草'],
    "清金降火汤": ['杏仁', '前胡', '桔梗', '浙贝母', '瓜蒌仁', '石膏', '枳壳', '陈皮', '黄芩', '茯苓', '甘草',
                   '半夏'],
    "石膏散": ['石膏', '炙甘草', '桔梗', '枇杷叶', '浙贝母', '桑皮', '栀子'],
    # "加减洗肺散":['天冬','麦冬','五味子','沙参','杏仁','桑皮','枇杷叶','六一散'],
    "加味玉露散": ['石膏', '滑石', '寒水石', '白药', '甘草', '桑皮', '枇杷叶', '麦冬', '竹叶', '五味子', '桔梗'],
    "清金白虎汤": ['石膏', '知母', '竹叶', '党参', '桑皮', '地骨皮', '桔梗', '甘草', '乌梅'],
    "温肺汤": ['干姜', '半夏', '杏仁', '陈皮', '甘草', '细辛', '阿胶', '生姜', '大枣'],
    "苏子汤": ['紫苏子', '干姜', '半夏', '桂心', '人参', '陈皮', '茯苓', '甘草'],
    "加减三奇汤": ['陈皮', '桔梗', '青皮', '紫苏梗', '半夏', '杏仁', '金沸草', '枳壳', '干姜', '甘草', '沉香'],
    "半夏温肺汤": ['半夏', '茯苓', '细辛', '干姜', '桂心', '桔梗', '陈皮', '复花', '人参', '白术', '甘草'],
    "加味理中汤": ['人参', '白术', '干姜', '甘草', '茯苓', '半夏', '陈皮', '细辛', '五味子', '款冬花'],
    "加味补肺汤": ['熟地黄', '肉桂', '人参', '紫菀', '黄芪', '桑皮', '五味子'],
    "黄芪汤": ['黄芪', '白芍', '麦冬', '五味子', '前胡', '人参', '细辛', '当归', '茯苓', '半夏', '大枣', '生姜'],
    "生脉地黄汤": ['人参', '麦冬', '五味子', '生地黄', '山药', '山萸', '茯苓', '牡丹皮', '泽泻'],
    "加减地黄汤": ['熟地黄', '生地黄', '山药', '山萸', '麦冬', '川贝', '茯苓', '甘草', '枸杞', '地骨皮', '阿胶'],
    "加味人参黄芪汤": ['人参', '黄芪', '白术', '陈皮', '茯苓', '甘草', '当归', '五味子', '麦冬', '紫菀', '款冬花'],
    # "加味白术汤": ['人参', '白术', '化橘红', '半夏', '茯苓', '浙贝母', '甘草', '前胡', '附片', '神曲'],
    "紫菀散": ['紫菀', '阿胶', '人参', '沙参', '麦冬', '川贝', '甘草', '茯苓', '桔梗', '五味子'],
    "二冬膏": ['天冬', '麦冬', '蜂蜜'],
    # "沙参麦冬汤": ['沙参', '麦冬', '玉竹', '甘草', '桑叶', '生扁豆', '白药'],
    # "润肺丸": ['诃子', '五倍子', '五味子', '甘草', '蜜丸噙化'],
    "加减人参冬花散": ['诃子', '人参', '款冬花', '浙贝母', '乌梅'],
    # "九仙散": ['人参', '款冬花', '桔梗', '桑皮', '五味子', '阿胶', '浙贝母', '乌梅', '罂粟壳', '干姜', '大枣'],
    # "加味诃黎勒丸": ['诃子', '海粉', '瓜蒌仁', '青黛', '杏仁', '马兜铃', '百合', '乌梅', '五味子'],
    # -----------------------咳嗽结束---------------------------

}

all_medicine = set()
for i in list(prescriptions.values()):
    for j in i:
        all_medicine.add(j)

med_count = dict()
for i in list(all_medicine):
    med_count[i] = 0

for i in list(prescriptions.values()):
    for j in i:
        med_count[j] = med_count[j] + 1

print("test")
